stm32duino/stm32_svd/svd/STM32WL3x/STM32WL3R.svd
<?xml version="1.0" encoding="UTF-8"?>
<!--
Copyright (c) 2025 STMicroelectronics.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <name>STM32WL3R</name>
  <version>1.0</version>
  <description>STM32WL3R</description>
  <cpu>
    <name>CM0+</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>0x20</size>
  <resetValue>0x0</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <description>ADC address block description</description>
      <groupName>ADC</groupName>
      <baseAddress>0x41006000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x68</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC</name>
        <description>ADC interrupt</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>VERSION_ID</name>
          <displayName>VERSION_ID</displayName>
          <description>VERSION_ID register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x21</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>VERSION_ID</name>
              <description>VERSION_ID[7:0]: version of the embedded IP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <displayName>CONF</displayName>
          <description>CONF register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x20002</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>CONT</name>
              <description>CONT: regular sequence runs continuously when ADC mode is enabled:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQUENCE</name>
              <description>SEQUENCE: enable the sequence mode (active by default):
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LEN</name>
              <description>SEQ_LEN[3:0]: number of conversions in a regular sequence:
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPS_SYNCHRO_ENA</name>
              <description>SMPS_SYNCHRO_ENA: synchronize the ADC start conversion with a pulse generated by the
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_RATE_LSB</name>
              <description>SAMPLE_RATE_LSB: Sample Rate LSB
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_RATE</name>
              <description>SAMPLE_RATE[1:0]: conversion rate of ADC (F_ADC):
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_DS_ENA</name>
              <description>DMA_DS_EN: enable the DMA mode for the Down Sampler data path:
</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR_DS_CFG</name>
              <description>OVR_DS_CFG: Down Sampler overrun configuration:
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIT_INVERT_SN</name>
              <description>BIT_INVERT_SN: invert bit to bit the ADC data output (1's complement) when a single
</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIT_INVERT_DIFF</name>
              <description>BIT_INVERT_DIFF: invert bit to bit the ADC data output (1's complement) when a differential
</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_CONT_1V2</name>
              <description>ADC_CONT_1V2: select the input sampling method:
</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_RATE_MSB</name>
              <description>SAMPLE_RATE_MSB: Sample Rate MSB
</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <displayName>CTRL</displayName>
          <description>CTRL register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>ADC_ON_OFF</name>
              <description>ADC_ON_OFF:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START_CONV</name>
              <description>START_CONV (1): generate a start pulse to initiate an ADC conversion:
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STOP_OP_MODE</name>
              <description>STOP_OP_MODE (1): stop the on-going OP_MODE (ADC mode, Analog audio mode, Full
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TEST_MODE</name>
              <description>TEST_MODE: select the functional or the test mode of the ADC:
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWITCH</name>
          <displayName>SWITCH</displayName>
          <description>SWITCH register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>SE_VIN_0</name>
              <description>SE_VIN_0[1:0]: input voltage for VINM[0] / VINP[0]-VINM[0]
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_VIN_1</name>
              <description>SE_VIN_1[1:0]: input voltage for VINM[1] / VINP[1]-VINM[1]
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_VIN_2</name>
              <description>SE_VIN_2[1:0]: input voltage for VINM[2] / VINP[2]-VINM[2]
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_VIN_3</name>
              <description>SE_VIN_3[1:0]: input voltage for VINM[3] / VINP[3]-VINM[3]
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_VIN_4</name>
              <description>SE_VIN_4[1:0]: input voltage for VINP[0]
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_VIN_5</name>
              <description>SE_VIN_5[1:0]: input voltage for VINP[1]
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_VIN_6</name>
              <description>SE_VIN_6[1:0]: input voltage for VINP[2]
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SE_VIN_7</name>
              <description>SE_VIN_7[1:0]: input voltage for VINP[3]
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DS_CONF</name>
          <displayName>DS_CONF</displayName>
          <description>DS_CONF register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DS_RATIO</name>
              <description>DS_RATIO[2:0]: program the Down Sampler ratio (N factor)
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DS_WIDTH</name>
              <description>DS_WIDTH[2:0]: program the Down Sampler width of data output (DSDTATA)
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_1</name>
          <displayName>SEQ_1</displayName>
          <description>SEQ_1 register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>SEQ0</name>
              <description>SEQ0[3:0]: channel number code for first conversion of the sequence
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ1</name>
              <description>SEQ1[3:0]: channel number code for second conversion of the sequence.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ2</name>
              <description>SEQ2[3:0]: channel number code for 3rd conversion of the sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ3</name>
              <description>SEQ3[3:0]: channel number code for 4th conversion of the sequence.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ4</name>
              <description>SEQ4[3:0]: channel number code for 5th conversion of the sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ5</name>
              <description>SEQ5[3:0]: channel number code for 6th conversion of the sequence.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ6</name>
              <description>SEQ6[3:0]: channel number code for 7th conversion of the sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ7</name>
              <description>SEQ7[3:0]: channel number code for 8th conversion of the sequence.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_2</name>
          <displayName>SEQ_2</displayName>
          <description>SEQ_2 register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>SEQ8</name>
              <description>SEQ8[3:0]: channel number code for 9th conversion of the sequence
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ9</name>
              <description>SEQ9[3:0]: channel number code for 10th conversion of the sequence.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ10</name>
              <description>SEQ10[3:0]: channel number code for 11th conversion of the sequence.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ11</name>
              <description>SEQ11[3:0]: channel number code for 12th conversion of the sequence.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ12</name>
              <description>SEQ12[3:0]: channel number code for 13th conversion of the sequence.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ13</name>
              <description>SEQ13[3:0]: channel number code for 14th conversion of the sequence.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ14</name>
              <description>SEQ14[3:0]: channel number code for 15th conversion of the sequence.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ15</name>
              <description>SEQ15[3:0]: channel number code for 16th conversion of the sequence.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_1</name>
          <displayName>COMP_1</displayName>
          <description>COMP_1 register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00555</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>GAIN1</name>
              <description>GAIN1[11:0]: first calibration point: gain AUXADC_GAIN_1V2[11:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET1</name>
              <description>OFFSET1[7:0]: first calibration point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_2</name>
          <displayName>COMP_2</displayName>
          <description>COMP_2 register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00555</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>GAIN2</name>
              <description>GAIN2[11:0]: second calibration point: gain AUXADC_GAIN_1V2[11:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET2</name>
              <description>OFFSET2[7:0]: second calibration point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_3</name>
          <displayName>COMP_3</displayName>
          <description>COMP_3 register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00555</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>GAIN3</name>
              <description>GAIN3[11:0]: third calibration point: gain AUXADC_GAIN_1V2[11:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET3</name>
              <description>OFFSET3[7:0]: third calibration point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_4</name>
          <displayName>COMP_4</displayName>
          <description>COMP_4 register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00555</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>GAIN4</name>
              <description>GAIN4[11:0]: fourth calibration point: gain AUXADC_GAIN_1V2[11:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET4</name>
              <description>OFFSET4[7:0]: fourth calibration point</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
