stm32duino/stm32_svd/svd/STM32WL3x/STM32WL3R.svd
        <register>
          <name>COMP_SEL</name>
          <displayName>COMP_SEL</displayName>
          <description>COMP_SEL register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>OFFSET_GAIN0</name>
              <description>OFFSET_GAIN0[1:0]: gain / offset used in ADC single negative mode with Vinput range =
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN1</name>
              <description>OFFSET_GAIN1[1:0]: gain / offset used in ADC single positive mode with Vinput range =
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN2</name>
              <description>OFFSET_GAIN2[1:0]: gain / offset used in ADC differential mode with Vinput range = 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN3</name>
              <description>OFFSET_GAIN3[1:0]: gain / offset used in ADC single negative mode with Vinput range =
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN4</name>
              <description>OFFSET_GAIN4[1:0]: gain / offset used in ADC single positive mode with Vinput range =
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN5</name>
              <description>OFFSET_GAIN5[1:0]: gain / offset used in ADC differential mode with Vinput range = 2.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN6</name>
              <description>OFFSET_GAIN6[1:0]: gain / offset used in ADC single negative mode with Vinput range =
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN7</name>
              <description>OFFSET_GAIN7[1:0]: gain / offset used in ADC single positive mode with Vinput range =
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFSET_GAIN8</name>
              <description>OFFSET_GAIN8[1:0]: gain / offset used in ADC differential mode with Vinput range = 3.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WD_TH</name>
          <displayName>WD_TH</displayName>
          <description>WD_TH register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFF0000</resetValue>
          <resetMask>0xFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WD_LT</name>
              <description>WD_LT[11:0]: analog watchdog low level threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WD_HT</name>
              <description>WD_HT[11:0]: analog watchdog high level threshold.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WD_CONF</name>
          <displayName>WD_CONF</displayName>
          <description>WD_CONF register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>AWD_CHX</name>
              <description>AWD_CHX[15:0]: analog watchdog channel selection to define which input channel(s) need
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DS_DATAOUT</name>
          <displayName>DS_DATAOUT</displayName>
          <description>DS_DATAOUT register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DS_DATA</name>
              <description>DS_DATA[15:0]: contain the converted data at the output of the Down Sampler.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_STATUS</name>
          <displayName>IRQ_STATUS</displayName>
          <description>IRQ_STATUS register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>EOC_IRQ</name>
              <description>EOC_IRQ (Used in test mode only): set when the ADC conversion is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EODS_IRQ</name>
              <description>EODS_IRQ: set when the Down Sampler conversion is completed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EOS_IRQ</name>
              <description>EOS_IRQ: set when a sequence of conversion is completed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWD_IRQ</name>
              <description>AWD_IRQ: set when an analog watchdog event occurs.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR_DS_IRQ</name>
              <description>OVR_DS_IRQ: set to indicate a Down Sampler overrun (at least one data is lost)
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_ENABLE</name>
          <displayName>IRQ_ENABLE</displayName>
          <description>IRQ_ENABLE register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>EOC_IRQ</name>
              <description>EOC_IRQ (Used in test mode only): set when the ADC conversion is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EODS_IRQ</name>
              <description>EODS_IRQ: set when the Down Sampler conversion is completed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EOS_IRQ</name>
              <description>EOS_IRQ: set when a sequence of conversion is completed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AWD_IRQ</name>
              <description>AWD_IRQ: set when an analog watchdog event occurs.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVR_DS_IRQ</name>
              <description>OVR_DS_IRQ: set to indicate a Down Sampler overrun (at least one data is lost)
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST_CONF</name>
          <displayName>TEST_CONF</displayName>
          <description>TEST_CONF register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>ADC_SWITCH_EN</name>
              <description>ADC_SWITCH_EN[15:0]: enable individually each connection of the switching matrix at the
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_VIN_TYPE</name>
              <description>SEL_VIN_TYPE[1:0]: operation mode of the selected VIN
</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_RUN</name>
              <description>ADC_RUN: Start/stop ADC conversion.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ENABLE</name>
              <description>ADC_ENABLE:
</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTB_CONF</name>
          <displayName>DTB_CONF</displayName>
          <description>DTB_CONF register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x1000A</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_DBG_CONF</name>
              <description>ADC_DBG_CONF[3:0]: use for debug purpose.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_DTB_CONF</name>
              <description>ADC_DTB_CONF[1:0]: configure the DTB output.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTB_SER_SEL</name>
              <description>DTB_SER_SEL: DTB serial output selection when ADC_DB_CONF[1:0]=3d
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSM_STATE</name>
              <description>FSM_STATE[7:0]: show the state of the state machine.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSM_CUR_STATE</name>
              <description>FSM_CUR_STATE[2:0]: show the last executed state by the state machine.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
