stm32duino/stm32_svd/svd/STM32WL3x/STM32WL3R.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DYNAMIC</name>
      <description>DYNAMIC_REG_BLOCK address block description</description>
      <groupName>DYNAMIC_REG_BLOCK</groupName>
      <baseAddress>0x49000500</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PCKTLEN_CONFIG</name>
          <displayName>PCKTLEN_CONFIG</displayName>
          <description>PCKTLEN_CONFIG register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000014</resetValue>
          <fields>
            <field>
              <name>PCKTLEN</name>
              <description>Length of packet in bytes for Normal mode with FIXED length mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MOD0_CONFIG</name>
          <displayName>MOD0_CONFIG</displayName>
          <description>MOD0_CONFIG register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00083A93</resetValue>
          <fields>
            <field>
              <name>DATARATE_M</name>
              <description>The Mantissa of the specified data rate (default: 38.4 ksps)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATARATE_E</name>
              <description>The exponent of the specified data rate (default: 38.4 ksps)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD_TYPE</name>
              <description>Modulation type:</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD_Reserved</name>
              <description>Free bit to expand MOD_TYPE in case more modulations to come in future evolutions</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FOUR_GFSK_CONST_MAP</name>
              <description>2- and 4-GFSK constellation mapping</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_SEL</name>
              <description>Select BT value for GFSK (0.5 or 1)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_CLKON_LOCKONTX</name>
              <description>Enable the clock on analog PA in LOCKONTX state:</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MOD1_CONFIG</name>
          <displayName>MOD1_CONFIG</displayName>
          <description>MOD1_CONFIG register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00400435</resetValue>
          <fields>
            <field>
              <name>FDEV_M</name>
              <description>Mantissa of the frequency deviation (default: 20 kHz)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDEV_E</name>
              <description>Exponent of the frequency deviation (default: 20 kHz)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHFLT_M</name>
              <description>Mantissa of the channel filter BW (default: 100 kHz)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHFLT_E</name>
              <description>Exponent of the channel filter BW (default: 100 kHz)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNTH_FREQ</name>
          <displayName>SYNTH_FREQ</displayName>
          <description>SYNTH_FREQ register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x04851615</resetValue>
          <fields>
            <field>
              <name>SYNTH_FRAC</name>
              <description>Fractional part of the  PLL fractional divide factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNTH_INT</name>
              <description>PLL integer divide factor (default: 868 MHz, XTAL: 48 MHz)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BS</name>
              <description>Synthesizer band selector, i.e. out-of-loop total divide factor, 4 or 8 (default: 826 MHz - 958 MHz band)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VCO_CAL_CONFIG</name>
          <displayName>VCO_CAL_CONFIG</displayName>
          <description>VCO_CAL_CONFIG register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00400088</resetValue>
          <fields>
            <field>
              <name>VCO_CALAMP_EXT</name>
              <description>VCO magnitude calibration word in thermometric code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCO_CALAMP_EXT_SEL</name>
              <description>Bit to provide external VCO calamp value through VCO_CALAMP_EXT:</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCO_CALFREQ_EXT</name>
              <description>VCO Cbank frequency calibration word.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCO_CALFREQ_EXT_SEL</name>
              <description>Bit to provide external VCO calfreq value through VCO_CALFREQ_EXT:</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCO_CALIB_REQ</name>
              <description>Define if the Radio FSM must launch a VCO calibration request after VCO start-up</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_TIMER</name>
          <displayName>RX_TIMER</displayName>
          <description>RX_TIMER register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RX_TIMEOUT</name>
              <description>RX timer timeout (relative duration in interpolated time=machine time unit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CS_TIMEOUT_MASK</name>
              <description>1 =&gt; CS value contributes to timeout disabling</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PQI_TIMEOUT_MASK</name>
              <description>1 =&gt; PQI value contributes to timeout disabling</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_SQI_TIMEOUT_MASK</name>
              <description>1 =&gt; SQI value contributes to timeout disabling</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_OR_nAND_SELECT</name>
              <description>Select logical OR or logcial AND to apply on CS/PQI/SQI timeout mask:</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATABUFFER_THR</name>
          <displayName>DATABUFFER_THR</displayName>
          <description>DATABUFFER_THR register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RX_ALMOST_FULL_THR</name>
              <description>Almost Full threshold for RX DataBuffers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ALMOST_EMPTY_THR</name>
              <description>Almost Empty threshold for TX DataBuffers.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFSEQ_IRQ_ENABLE</name>
          <displayName>RFSEQ_IRQ_ENABLE</displayName>
          <description>RFSEQ_IRQ_ENABLE register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TX_DONE_E</name>
              <description>Enable interrupt on TX_DONE_F flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_OK_E</name>
              <description>Enable interrupt on RX_OK_F flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TIMEOUT_E</name>
              <description>Enable interrupt on RX_TIMEOUT_F flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CRC_ERROR_E</name>
              <description>Enable interrupt on RX_CRC_ERROR_F flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_RX_TERM_E</name>
              <description>Enable interrupt on FAST_RX_TERM_F flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTIMER_STOP_CDT_E</name>
              <description>Enable interrupt on RXTIMER_STOP_CDT_F flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SABORT_DONE_E</name>
              <description>Enable interrupt on SABORT command treated and done flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND_REJECTED_E</name>
              <description>Enable interrupt on COMMAND_REJECTED flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS_E</name>
              <description>Enable interrupt on CS_F flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREAMBLE_VALID_E</name>
              <description>Enable interrupt on PREAMBLE_VALIF_F flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_VALID_E</name>
              <description>Enable interrupt on SYNC_VALIF_F flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATABUFFER0_USED_E</name>
              <description>Enable interrupt on DATABUFFER0_USED_F flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATABUFFER1_USED_E</name>
              <description>Enable interrupt on DATABUFFER1_USED_F flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ALMOST_FULL_0_E</name>
              <description>Enable interrupt on RX_ALMOST_FULL_0_F flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ALMOST_FULL_1_E</name>
              <description>Enable interrupt on RX_ALMOST_FULL_1_F flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ALMOST_EMPTY_0_E</name>
              <description>Enable interrupt on TX_ALMOST_EMPTY_0_F flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ALMOST_EMPTY_1_E</name>
              <description>Enable interrupt on TX_ALMOST_EMPTY_1_F flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_ACCESS_ERROR_E</name>
              <description>Enable interrupt on AHB_ACCESS_ERROR_F flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HW_ANA_FAILURE_E</name>
              <description>Enable interrupt on HW_ANA_FAILURE_F flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_E</name>
              <description>Enable interrupt on SEQ_F flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RRM_CMD_START_E</name>
              <description>Enable interrupt on RRM_CMD_START_F flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RRM_CMD_END_E</name>
              <description>Enable interrupt on RRM_CMD_END_F flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAFEASK_CALIB_DONE_E</name>
              <description>Enable interrupt on SAFEASK_CALIB_DONE_F flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_AAF_CALIB_DONE_E</name>
              <description>Enable interrupt on AGC_AAF_CALIB_DONE_F flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDITIONAL_CTRL</name>
          <displayName>ADDITIONAL_CTRL</displayName>
          <description>ADDITIONAL_CTRL register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00038800</resetValue>
          <fields>
            <field>
              <name>CH_NUM</name>
              <description>Channel number. This value is multiplied by the channel spacing and added to the synthesizer base frequency to generate the actual RF carrier frequency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_SPACING</name>
              <description>Channel spacing. From ~732 Hz to ~187 kHz in 732 Hz steps - default: 100 kHz.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_FC</name>
              <description>Power control bandwidth selection according datarate:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIME_CAPTURESEL</name>
              <description>Select the trigger event that captures the absolute time in the TIME_CAPTURE[31:0] register</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AS_ENABLE</name>
              <description>Enable antenna switching</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAST_RX_TIMER</name>
          <displayName>FAST_RX_TIMER</displayName>
          <description>FAST_RX_TIMER register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FAST_RX_TIMEOUT</name>
              <description>Timer unit is (2**CHFLT_E x 8) / sys_freq with sys_freq = 16 MHz</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_CS_TERM_EN</name>
              <description>Fast RX Termination timer value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMMAND</name>
          <displayName>COMMAND</displayName>
          <description>COMMAND register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMMAND_ID</name>
              <description>Opcode coresponding to a command:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACK2ACTIVE2</name>
              <description>Default/return state for the Radio FSM is ACTIVE2</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BACK2LOCKON</name>
              <description>Target/return state for the Radio FSM when exiting a RX or a PA_DWN_ANA state is LOCKON.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
