stm32duino/stm32_svd/svd/STM32WL3x/STM32WL3R.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWRC</name>
	  <description>PWRC address block description</description>
      <groupName>PWRC</groupName>
      <baseAddress>0x48500000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PVD</name>
        <description>PVD interrupt</description>
        <value>2</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>CR1 register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000114</resetValue>
          <fields>
            <field>
              <name>LPMS</name>
              <description>LPMS Low Power Mode Selection
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENSDNBOR</name>
              <description>ENSDNBOR: Enable BOR supply monitoring during shutdown mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIAS_RUN_AUTO</name>
              <description>IBIAS_RUN_AUTO: Enable automatic IBIAS control during RUN/DEEPSTOP mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBIAS_RUN_STATE</name>
              <description>IBIAS_RUN_STATE: Enable/Disable IBIAS during RUN mode when automatic mode is
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APC</name>
              <description>APC Apply Pull-up and pull-down configuration from CPU
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENBORH</name>
              <description>ENBORH: enable BORH configuration
</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENBORL</name>
              <description>ENBORL: Enable BORL reset supervising during RUN mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>CR2 register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PVDE</name>
              <description>PVDE Programmable Voltage Detector Enable
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVDLS</name>
              <description>PVDLS[2:0] Programmable Voltage Detector Level selection
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBGRET</name>
              <description>DBGRET: PA2 and PA3 retention enable after DEEPSTOP
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPREG_FORCE_VH</name>
              <description>force LPREG=1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPREG_VH_STATUS</name>
              <description>status LPREG VH (1.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIORET</name>
              <description>GPIORET: GPIO retention enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFREGEN</name>
              <description>RFREGEN: RF Regulator Enable
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFREGCEXT</name>
              <description>RFREGCEXT: RF Regulator External Supply Bypass
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFREGBYP</name>
              <description>RFREGBYP: RF Regulator Bypass Enable
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFREGRDY</name>
              <description>RFDREGRDY: RF Regulator Ready flag
</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RFREGON_STATUS</name>
              <description>RFREGON_STATUS:  RF Regulator On Status
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEWU</name>
          <displayName>IEWU</displayName>
          <description>IEWU register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIWL0</name>
              <description>EWL0 Enable Internal WakeUp line LPUART
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EIWL1</name>
              <description>EIWL1 Enable Internal WakeUp line RTC
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EIWL2</name>
              <description>EIWL2 Enable Internal WakeUp line LCD
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EIWL3</name>
              <description>EIWL3 Enable Internal Wakeup line COMP
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EIWL4</name>
              <description>EIWL4 Enable Internal Wakeup line LCSC
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EWMRSUBG</name>
              <description>EWMRSUB Wakeup MRSUBG Enable
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EWMRSUBGHCPU</name>
              <description>EWMRSUBGHCPU Wakeup MRSUBG Host CPU Enable
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IWUP</name>
          <displayName>IWUP</displayName>
          <description>IWUP register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IWUP0</name>
              <description>IWUP0: Wakeup polarity for internal wakeup line 0 event (LPUART).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUP1</name>
              <description>IWUP1: Wakeup polarity for internal wakeup line 1 event (RTC).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUP2</name>
              <description>IWUP2: Wakeup polarity for internal wakeup line 2 event (LCD).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUP3</name>
              <description>IWUP3: Wakeup polarity for internal wakeup line 3 event (COMP).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUP4</name>
              <description>IWUP4: Wakeup polarity for internal wakeup line 4 event (LCSC).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMRSUBGHP</name>
              <description>WMRSUBGHP: Wakeup polarity for internal wakeup MRSUBG event
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMRSUBGHCPUP</name>
              <description>WMRSUBGHCPUP: Wakeup polarity for internal wakeup MRSUBG Host CPU event
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IWUF</name>
          <displayName>IWUF</displayName>
          <description>IWUF register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IWUF0</name>
              <description>IWUF0: Internal wakeup flag (LPUART).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUF1</name>
              <description>IWUF1: Internal wakeup flag (RTC).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUF2</name>
              <description>IWUF2: Internal wakeup flag (LCD).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUF3</name>
              <description>IWUF3: Internal wakeup flag (COMP).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IWUF4</name>
              <description>IWUF4: Internal wakeup flag (LCSC).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMRSUBGF</name>
              <description>WMRSUBGF Wakeup MRSUBG Flag
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WMRSUBGHCPUF</name>
              <description>WMRSUBGHCPUF Wakeup MRSUBG HOST CPU Flag (cf.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <displayName>SR2</displayName>
          <description>SR2 register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000F3F6</resetValue>
          <fields>
            <field>
              <name>SMPSBYPR</name>
              <description>SMPSBYPR: SMPS Force Bypass Control Replica
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SMPSENR</name>
              <description>SMPSENR: SMPS Enable Control Replica
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SMPSRDY</name>
              <description>SMPSRDY: SMPS Ready Status
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IOBOOTVAL2</name>
              <description>Bit3: PB15  input value on VDD33 latched at POR
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REGLPS</name>
              <description>REGLPS: Regulator Low Power Started
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REGMS</name>
              <description>REGMS: Main regulator ready status.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVDO</name>
              <description>PVDO: Power Voltage Detector Output
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IOBOOTVAL</name>
              <description>Bit3: PA11  input value on VDD33 latched at POR
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR5</name>
          <displayName>CR5</displayName>
          <description>CR5 register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00006014</resetValue>
          <fields>
            <field>
              <name>SMPSLVL</name>
              <description>SMPSLVL[3:0] SMPS Output Level Voltage Selection
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPSBOMSEL</name>
              <description>SMPSBOMSEL: SMPS BOM Selection:
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPS_BOF_STATIC</name>
              <description>SMPS_BOF_STATIC: SMPS Bypass on the Fly static
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOSMPS_BOF</name>
              <description>NOSMPS_BOF: No SMPS Mode to be used in accordance to SMPS_BOF_STATIC =1
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPSLPOPEN</name>
              <description>SMPSLPOPEN: In Low Power mode SMPS is in OPEN mode (instead of PRECHARGE mode).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPSFBYP</name>
              <description>SMPSFB Force SMPS Regulator in bypass mode
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOSMPS</name>
              <description>NOSMPS: No SMPS Mode
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPS_ENA_DCM</name>
              <description>SMPS_ENA_DCM: enable discontinuous conduction mode
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDETR_DISABLE</name>
              <description>CLKDETR_DISABLE: disable SMPS clock detection
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPS_PRECH_CUR_SEL</name>
              <description>SMPS_PRECH_CUR_SEL[1:0] Selection for SMPS PRECHARGE limit current
</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPS_BOF_DYN</name>
              <description>SMPS_BOF_DYN: SMPS Bypass on the Fly dynamic
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRA</name>
          <displayName>PUCRA</displayName>
          <description>PUCRA register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000FFF7</resetValue>
          <fields>
            <field>
              <name>PUA</name>
              <description>PUA[x] : Pull Up Port A
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRA</name>
          <displayName>PDCRA</displayName>
          <description>PDCRA register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>PDA_1</name>
              <description>PDA[x]: Pull Down Port A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDS</name>
              <description>UDS Ultra DeepStop Mode Selection
</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDA_2</name>
              <description>PDA[x]: Pull Down Port A</description>
              <bitOffset>7</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRB</name>
          <displayName>PUCRB</displayName>
          <description>PUCRB register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>PUB</name>
              <description>PUB[x] : Pull Up Port B
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRB</name>
          <displayName>PDCRB</displayName>
          <description>PDCRB register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDB</name>
              <description>PDB[x]: Pull Down Port B
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EWUA</name>
          <displayName>EWUA</displayName>
          <description>EWUA register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EWUA</name>
              <description>EWUA[x] Enable WakeUp line PA[x]
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WUPA</name>
          <displayName>WUPA</displayName>
          <description>WUPA register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WUPA</name>
              <description>WUPA[x] Wake-up Line PA[x] Polarity
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
