stm32duino/stm32_svd/svd/STM32WL3x/STM32WL3R.svd
        <register>
          <name>APB0SMENR</name>
          <displayName>APB0SMENR</displayName>
          <description>APB0SMENR register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000FF03</resetValue>
          <fields>
            <field>
              <name>TIM2SMEN</name>
              <description>TIM2 bus clock enable during Sleep mode bit
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM16SMEN</name>
              <description>TIM16 bus clock enable during Sleep mode bit
</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCFGSMEN</name>
              <description>SYSCFG bus clock enable during Sleep mode bit
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSMEN</name>
              <description>LCDC bus clock enable during Sleep mode bit
</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPSMEN</name>
              <description>COMP bus clock enable during Sleep mode bit
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DACSMEN</name>
              <description>DAC bus clock enable during Sleep mode bit
</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCSMEN</name>
              <description>RTC bus clock enable during Sleep mode bit
</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCSCSMEN</name>
              <description>LCSC bus clock enable during Sleep mode bit
</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDGSMEN</name>
              <description>WDG clock enable during Sleep mode bit
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBGMCUSMEN</name>
              <description>DBGMCU clock enable during Sleep mode bit
</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1SMENR</name>
          <displayName>APB1SMENR</displayName>
          <description>APB1SMENR register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00A04511</resetValue>
          <fields>
            <field>
              <name>SPI1SMEN</name>
              <description>SPI1 bus clock enable during Sleep mode bit
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCDIGSMEN</name>
              <description>ADCDIG bus clock enable during Sleep mode bit
</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUARTSMEN</name>
              <description>LPUART bus clock enable during Sleep mode bit
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USARTSMEN</name>
              <description>USART bus clock enable during Sleep mode bit
</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI3SMEN</name>
              <description>SPI3 bus clock enable during Sleep mode bit
</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1SMEN</name>
              <description>I2C1 clock enable during Sleep mode bit
</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C2SMEN</name>
              <description>I2C2 clock enable during Sleep mode bit
</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RETAINED</name>
      <description>RETAINED_REG_BLOCK address block description</description>
      <groupName>RETAINED_REG_BLOCK</groupName>
      <baseAddress>0x49000780</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MRSUBG_TIMER_CPU_WKUP</name>
        <description>CPU Wakeup interrupt</description>
        <value>23</value>
      </interrupt>
      <registers>
        <register>
          <name>RFIP_WAKEUPTIME</name>
          <displayName>RFIP_WAKEUPTIME</displayName>
          <description>RFIP_WAKEUPTIME register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RFIP_WAKEUPTIME</name>
              <description>(Absolute) Target time to wakeup the RFIP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_WAKEUPTIME</name>
          <displayName>CPU_WAKEUPTIME</displayName>
          <description>CPU_WAKEUPTIME register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPU_WAKEUPTIME</name>
              <description>(Absolute) Target time to wakeup the CPU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP_CTRL</name>
          <displayName>WAKEUP_CTRL</displayName>
          <description>WAKEUP_CTRL register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SOC_WAKEUP_OFFSET</name>
              <description>Delay to be taken into account by the Wakeup block to anticipate the wakeup req to the PWRC of the SoC versus the target to wakeup the RFIP (or the CPU)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_WAKEUP_EN</name>
              <description>Indicates if the wakeup timer has to wakeup the SoC + sets the CPU_WAKEUP_F in the WAKEUP_IRQ_STATUS misc register when trigger event occurs</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFIP_WAKEUP_EN</name>
              <description>Indicates if the wakeup timer has to wakeup the SoC + trigger an event on the sequencer  + sets the CPU_WAKEUP_F in the WAKEUP_IRQ_STATUS misc register when trigger event occurs.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RRM_CMDLIST_PTR</name>
          <displayName>RRM_CMDLIST_PTR</displayName>
          <description>RRM_CMDLIST_PTR register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMDLIST_PTR_OFFSET</name>
              <description>Contain the offset versus the RAM base address of the RRM-UDRA command list entry point.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMDLIST_PTR_VALID</name>
              <description>Indicate if a command list has to be executed or not:</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_GLOBALTABLE_PTR</name>
          <displayName>SEQ_GLOBALTABLE_PTR</displayName>
          <description>SEQ_GLOBALTABLE_PTR register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEQ_GLOBALTABLE_PTR</name>
              <description>Contain the offset versus the RAM base address of the GlobalConfiguration RAM table entry point</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
