stm32duino/stm32_svd/svd/STM32WL3x/STM32WL3R.svd
        <register>
          <name>IQC_CONFIG</name>
          <displayName>IQC_CONFIG</displayName>
          <description>IQC_CONFIG register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <fields>
            <field>
              <name>IQC_CORRECT_IN</name>
              <description>Correction value Input for the IQ compensation engine (to be used as starting point or when the engine is disabled).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOAD_IQC_INIT</name>
              <description>Action bit to load the IQC_CORRECT_IN[23:0] bit field in the recirculation register when this bit is written to 1.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>REUSE_CORRECTION</name>
              <description>Reuse last correction value</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IQC_ENABLE</name>
              <description>Enable IQC</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSSS_CTRL</name>
          <displayName>DSSS_CTRL</displayName>
          <description>DSSS_CTRL register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACQ_WINDOW</name>
              <description>DSSS Acquisition window</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPREADING_EXP</name>
              <description>DSSS spreading exponent</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSSS_EN</name>
              <description>DSSS mode enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AQC_HITS</name>
              <description>DSSS acquisition hits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACQ_THR</name>
              <description>DSSS acquisition threshold</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>STATUS</name>
      <description>STATUS_REG_BLOCK address block description</description>
      <groupName>STATUS_REG_BLOCK</groupName>
      <baseAddress>0x49000600</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RFSEQ_IRQ_STATUS</name>
          <displayName>RFSEQ_IRQ_STATUS</displayName>
          <description>RFSEQ_IRQ_STATUS register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TX_DONE_F</name>
              <description>Transmission done flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_OK_F</name>
              <description>Reception ended and OK flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TIMEOUT_F</name>
              <description>Reception timeout flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CRC_ERROR_F</name>
              <description>Reception with CRC error flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAST_RX_TERM_F</name>
              <description>Fast RX Termination flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTIMER_STOP_CDT_F</name>
              <description>RX Timer stopped by stop condition flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SABORT_DONE_F</name>
              <description>SABORT command treated and done flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMMAND_REJECTED_F</name>
              <description>Command rejection flag.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS_F</name>
              <description>Carrier Sense (RSSI over threshold) flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREAMBLE_VALID_F</name>
              <description>Valid Preamble detection flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_VALID_F</name>
              <description>Valid SYNC word detection flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATABUFFER0_USED_F</name>
              <description>Data Buffer 0 fully read in TX or fully written in RX flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATABUFFER1_USED_F</name>
              <description>Data Buffer 1 fully read in TX or fully written in RX flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ALMOST_FULL_0_F</name>
              <description>Data Buffer 0 written up to programmed thresold flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ALMOST_FULL_1_F</name>
              <description>Data Buffer 1 written up to programmed thresold flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ALMOST_EMPTY_0_F</name>
              <description>Data Buffer 0 read up to programmed thresold flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_ALMOST_EMPTY_1_F</name>
              <description>Data Buffer 1 read up to programmed thresold flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_ACCESS_ERROR_F</name>
              <description>An AHB transfer issue occurred for one of the AHB masters (RRM, Data Buffer Manager, Sequencer). Details in an annex register = RFSEQ_STATUS_DETAIL.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HW_ANA_FAILURE_F</name>
              <description>Analog HW failure flag (PLL lock / unlock error, calibration error)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_F</name>
              <description>Sequencer completion flag, indicates that the sequencer sequence has ended, it can be because of an action timeout of a normal sequence completion, the detail can be found in the annex register RFSEQ_STATUS_DETAIL.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RRM_CMD_START_F</name>
              <description>RRM-UDRA command list execution started flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RRM_CMD_END_F</name>
              <description>RRM-UDRA command list execution ended flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAFEASK_CALIB_DONE_F</name>
              <description>End of Safe-ASK PA calibration flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_AAF_CALIB_DONE_F</name>
              <description>Valid RSSI value available in the RSSI_RUNNING bit field flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFSEQ_STATUS_DETAIL</name>
          <displayName>RFSEQ_STATUS_DETAIL</displayName>
          <description>RFSEQ_STATUS_DETAIL register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RRM_ADDRESS_ERROR_F</name>
              <description>RRM AHB master tried to access to an unmapped RAM address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBM_ADDRESS_ERROR_F</name>
              <description>Data Buffer Manager AHB master tried to access to an unmapped RAM address</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_ADDRESS_ERROR_F</name>
              <description>Sequencer AHB master tried to access to an unmapped RAM address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBM_FIFO_ERROR_F</name>
              <description>Data Buffer Manager internal FIFO overflow/underflow flag.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_LOCK_FAIL_F</name>
              <description>PLL lock fail status flag.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_UNLOCK_F</name>
              <description>PLL unlock event flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_CALFREQ_ERROR_F</name>
              <description>VCO frequency calibration error flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_CALAMP_ERROR_F</name>
              <description>VCO amplitude calibration error flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_ACTIONTIMEOUT_F</name>
              <description>The sequencer sequence has ended because the current action has reach its action timeout</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_COMPLETE_F</name>
              <description>The sequencer sequence is complete because the last defined action was terminated properly ( nextActionXPtr is null)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIO_FSM_INFO</name>
          <displayName>RADIO_FSM_INFO</displayName>
          <description>RADIO_FSM_INFO register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RADIO_FSM_STATE</name>
              <description>State of the Radio FSM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_INDICATOR</name>
          <displayName>RX_INDICATOR</displayName>
          <description>RX_INDICATOR register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RSSI_LEVEL_ON_SYNC</name>
              <description>RSSI level captured at the end of the SYNC word detection of the received packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI_LEVEL_RUN</name>
              <description>Continuous level of the output of the measured RSSI value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AGC_WORD</name>
              <description>AGC word of the received packet.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANT_SELECT</name>
              <description>Currently selected antenna</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_INFO_REG</name>
          <displayName>RX_INFO_REG</displayName>
          <description>RX_INFO_REG register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RX_PCKTLEN_OUT</name>
              <description>Indicates number of Data Buffer already used (fully written / fully read)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CRC_REG</name>
          <displayName>RX_CRC_REG</displayName>
          <description>RX_CRC_REG register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RX_CRC_OUT</name>
              <description>CRC field of the received packet (read-only info)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QI_INFO</name>
          <displayName>QI_INFO</displayName>
          <description>QI_INFO register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PQI_INFO</name>
              <description>Preamble Quality Indicator (PQI) value of the received packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SQI_INFO</name>
              <description>SQI value of the received packet. Represents the peak value between 0 and 32</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SQI_SEC</name>
              <description>Indicate if measured SQI refers to SYNC word or secondary SYNC word:</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AFC_CORRECTION</name>
              <description>AFC value frozed at sync reception</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATABUFFER_INFO</name>
          <displayName>DATABUFFER_INFO</displayName>
          <description>DATABUFFER_INFO register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CURRENT_DATABUFFER_COUNT</name>
              <description>Indicates the number of bytes used in the last DATA BUFFER used:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NB_DATABUFFER_USED</name>
              <description>Provides the number of data buffers which have been fully used:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CURRENT_DATABUFFER</name>
              <description>Indicates which Data Buffer is currently used by the HW:</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIME_CAPTURE</name>
          <displayName>TIME_CAPTURE</displayName>
          <description>TIME_CAPTURE register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIME_CAPTURE</name>
              <description>Absolute time value captured on specific event programmed through TIME_CAPTURESEL bit field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IQC_CORRECTION_OUT</name>
          <displayName>IQC_CORRECTION_OUT</displayName>
          <description>IQC_CORRECTION_OUT register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IQC_CORRECT_OUT</name>
              <description>Final correction value output from IQC (compensation  engine)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_SAFEASK_OUT</name>
          <displayName>PA_SAFEASK_OUT</displayName>
          <description>PA_SAFEASK_OUT register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PA_CODEMAX</name>
              <description>Safe ASK level (provided by the CALIB_SAFEASK command)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
