stm32duino/stm32_svd/svd/STM32WL3x/STM32WL3R.svd
        <register>
          <name>VCO_CALIB_OUT</name>
          <displayName>VCO_CALIB_OUT</displayName>
          <description>VCO_CALIB_OUT register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000FF40</resetValue>
          <fields>
            <field>
              <name>VCO_CALFREQ_OUT</name>
              <description>VCO calfreq value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VCO_CALAMP_OUT</name>
              <description>VCO calamp value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_INFO</name>
          <displayName>SEQ_INFO</displayName>
          <description>SEQ_INFO register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEQ_FSM_STATE</name>
              <description>State of the sequencer internal FSM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_EVENT_STATUS</name>
          <displayName>SEQ_EVENT_STATUS</displayName>
          <description>SEQ_EVENT_STATUS register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEQ_EVENT_STATUS</name>
              <description>Value of the Internal shadow register of the Sequencer, used for NextActionXMask match comparison (useful for Sequencer scenario debug)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
	  <description>SYSCFG address block description</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x48</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIE_ID</name>
          <displayName>DIE_ID</displayName>
          <description>DIE_ID register</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000120</resetValue>
          <fields>
            <field>
              <name>REVISION</name>
              <description>Cut revision (metal fix)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VERSION</name>
              <description>Cut version</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRODUCT</name>
              <description>Product version.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAG_ID</name>
          <displayName>JTAG_ID</displayName>
          <description>JTAG_ID register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x02027041</resetValue>
          <fields>
            <field>
              <name>MANUF_ID</name>
              <description>Manufacturer ID</description>
              <bitOffset>1</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PART_NUMBER</name>
              <description>Part number</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VERSION_NUMBER</name>
              <description>Version</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_FMP_CTRL</name>
          <displayName>I2C_FMP_CTRL</displayName>
          <description>I2C_FMP_CTRL register</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>I2C1_PA0_FMP</name>
              <description>I2C1 Fast-Mode Plus driving capability for I2C1_SCL on PA0 I/O.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_PA1_FMP</name>
              <description>I2C1 Fast-Mode Plus driving capability for I2C1_SDA on PA1 I/O.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_PB6_FMP</name>
              <description>I2C1 Fast-Mode Plus driving capability for I2C1_SCL on PB6 I/O.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_PB7_FMP</name>
              <description>I2C1 Fast-Mode Plus driving capability for I2C1_SDA on PB7 I/O.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_PB10_FMP</name>
              <description>I2C1_PB10_FMP: I2C1 Fast-Mode Plus driving capability for I2C1_SDA on PB10 I/O.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_PB11_FMP</name>
              <description>I2C1_PB11_FMP: I2C1 Fast-Mode Plus driving capability for I2C1_SCL on PB11 I/O.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C2_PA6_FMP</name>
              <description>I2C2_PA6_FMP: I2C2 Fast-Mode Plus driving capability for I2C2_SCL on PA6 I/O.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C2_PA7_FMP</name>
              <description>I2C2_PA7_FMP: I2C2 Fast-Mode Plus driving capability for I2C2_SDA on PA7 I/O.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C2_PA13_FMP</name>
              <description>I2C2_PA13_FMP: I2C2 Fast-Mode Plus driving capability for I2C2_SCL on PA13 I/O.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C2_PA14_FMP</name>
              <description>I2C2_PA14_FMP: I2C2 Fast-Mode Plus driving capability for I2C2_SDA on PA14 I/O.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_DTR</name>
          <displayName>IO_DTR</displayName>
          <description>IO_DTR register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PA0_DT</name>
              <description>PA0_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA1_DT</name>
              <description>PA1_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA2_DT</name>
              <description>PA2_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA3_DT</name>
              <description>PA3_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA4_DT</name>
              <description>PA4_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA5_DT</name>
              <description>PA5_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA6_DT</name>
              <description>PA6_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA7_DT</name>
              <description>PA7_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA8_DT</name>
              <description>PA8_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA9_DT</name>
              <description>PA9_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA10_DT</name>
              <description>PA10_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA11_DT</name>
              <description>PA11_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA12_DT</name>
              <description>PA12_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA13_DT</name>
              <description>PA13_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA14_DT</name>
              <description>PA14_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA15_DT</name>
              <description>PA15_DT:      Interrupt Detection Type for port A I/Os.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB0_DT</name>
              <description>PB0_DT:      Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB1_DT</name>
              <description>PB1_DT:      Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB2_DT</name>
              <description>PB2_DT:      Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB3_DT</name>
              <description>PB3_DT:      Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB4_DT</name>
              <description>PB4_DT:      Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB5_DT</name>
              <description>PB5_DT:      Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB6_DT</name>
              <description>PB6_DT:      Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB7_DT</name>
              <description>PB7_DT:      Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB8_DT</name>
              <description>PB8_DT:       Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB9_DT</name>
              <description>PB9_DT:        Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB10_DT</name>
              <description>PB10_DT:      Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB11_DT</name>
              <description>PB11_DT:        Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB12_DT</name>
              <description>PB12_DT:      Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB13_DT</name>
              <description>PB13_DT:      Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB14_DT</name>
              <description>PB14_DT:      Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PB15_DT</name>
              <description>PB15_DT:      Interrupt Detection Type for port B I/Os.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
